#字典类型转换

var = [
        ['ZB','钟宝'],
        ['GL','郭磊'],
        ['CH','陈行'],
        ['WK','王凯'],
        ['ZHX','张鸿喜']
]#二级列表


var = (
        ('ZB','钟宝'),
        ('GL','郭磊'),
        ('CH','陈行'),
        ('WK','王凯'),
        ('ZHX','张鸿喜')
)#二级元组

var = [
        ('ZB','钟宝'),
        ('GL','郭磊'),
        ('CH','陈行'),
        ('WK','王凯'),
        ('ZHX','张鸿喜')
]#二级列表（外层列表，内层元组）


var = (
        ['ZB','钟宝'],
        ['GL','郭磊'],
        ['CH','陈行'],
        ['WK','王凯'],
        ['ZHX','张鸿喜']
)#二级元组（避免外层元组， 内层列表)


var = {
        ('ZB','钟宝'),
        ('GL','郭磊'),
        ('CH','陈行'),
        ('WK','王凯'),
        ('ZHX','张鸿喜')
}

#输出原有类型和值
print(type(var),var)
#转换操作
newvar = dict(var)

#输出转换之后的类型和值
print(type(newvar),newvar)
