#多项分支
'''
#设定变量
week = 4

#根据星期几 检测当天吃什么

if week == 1:
    print('今天是周一，我们吃西红柿炒番茄！')
    print('今天是周一，我们吃西红柿炒番茄！')
elif week == 2:
    print('今天是周二，我们吃马铃薯炖土豆！')
    print('今天是周二，我们吃马铃薯炖土豆！')
elif week == 3:
    print('今天是周三，我们吃老母鸡炖小母鸡！')
    print('今天是周三，我们吃老母鸡炖小母鸡！')
elif week == 4:
    print('今天是周四，我们吃大米煮小米')
    print('今天是周四，我们吃大米煮小米')
elif week == 5:
    print('今天是周五，我们吃白薯炖地瓜')
    print('今天是周五，我们吃白薯炖地瓜')
else:
    print('今天是周末，饿着！')
    print('今天是周末，饿着！')

'''

'''
#判断成绩

cj = 17


if cj == 100:#判断满分
    print('满分，你牛逼了，666666')
elif cj>=85 and cj<=99:#判断优秀
    print('成绩优秀，你是个好人！')
elif cj>=75 and cj<=84:#判断良好
    print('成绩良好，班内绝大多数')
elif cj>=60 and cj<=74:#判断及格
    print('及格万岁，多一分浪费没少一分犯罪！')
else:#判断不及格！
    print('大哥要做个保健不！（不及格的下场）')

'''

cj = 78

if cj == 100:#判断满分
    print('满分，你牛逼了，666666')
elif cj>=85:#判断优秀
    print('成绩优秀，你是个好人！')
elif cj>=75:#判断良好
    print('成绩良好，班内绝大多数')
elif cj>=60:#判断及格
    print('及格万岁，多一分浪费没少一分犯罪！')
else:#判断不及格！
    print('大哥要做个保健不！（不及格的下场）')

