'''
#声明一个二级列表(二级列表中的数据长度相同)

lists = [
            ['吕欣','李丛丛'],
            ['韩培南','刘铭宇'],
            ['王娇娇','兰婉婷'],
            ['万玲云','游可欣'],
            ['张艺潇','关靖霖'],
            ['高越','吴磊']
]


#for..in遍历
for one,two in lists:
    print(one)
    print(two)
'''



#声明一个二级列表（二级列表中的长度不定)

lists = [
            ['吕欣','李丛丛','王晓雨'],
            ['任泽权','韩培南'],
            ['兰婉婷','王娇娇','王雷雨','王震雨'],
            ['雍建凯','李艳玲','万玲云','游可欣','天宇']
]


#for ..in遍历

#遍历外层的一级列表
for one in lists:
    #print(one)
    #内部遍历二级列表
    for two in one:
        #输出二级列表中的数据
        print(two)
