#列表的遍历操作

lists = ['杨帅','张亮','吴磊','钟宝','郭磊','陈行','冯锴']

'''

#使用while来遍历

#获取列表的长度

cd = len(lists)

i = 0

while i < cd:

    #使用缩进输出每个元素
    print(lists[i])
    #i+1操作
    i += 1

'''

'''

#for ..in 遍历

for one in lists:
    print(one)

'''


#遍历二级列表（第二级长度相同的二级列表）

py03 = [
    ['许广文','男','女'],
    ['刘建星','男','捡煤球'],
    ['崔振铎','男','捡烟头'],
    ['杨惠钧','女','健美球'],
    ['王娇娇','女','羽毛球']
]


for name,sex,hobby in py03:
    #print(name,sex,hobby)

    print('{0}，性别{1},爱好{2}。'.format(name,sex,hobby))

#遍历二级列表（第二级长度不同）

py03 = [
    ['王晓雨','李丛丛','张蓓','牛少朋','吕欣'],
    ['任泽权','吴升宇','王永君','牛广林'],
    ['冯锴','杨帅','高茂盛','王娇娇','兰婉婷','王雷雨','曹组亚'],
    ['万玲云','游可欣','田宇','白立朋','赵泽林'],
    ['张天赢','张艺潇','吴琦','关靖霖']
]


for one in py03:
    #第二次遍历
    for two in one:
        print(two)
