'''
#字符串遍历

str1 = '昨天晚上梦到了前女友！不可描述的事情并没有发生！'

for onechar in str1:
    print(onechar)
'''

'''
#列表的遍历

list1 = ['甘宁','庞德','夏侯渊','司马懿','张辽','张郃']

for one in list1:
    print(one)
'''


'''
#遍历元组
tuple1 = ('刘备','赵云','马云','马化腾','马加爵','马超')

for i in tuple1:
    print(i)
'''

'''
#使用for..in 进行数据过滤操作

lists = ['A',12,3.5,7,36,8,'C','D',5.3,'Z',('黄土','高坡')]

#获取列表中的所有整型
for i in lists:
    #判断数据类型
    if isinstance(i,str):
        print(i)
'''

'''
#集合的遍历
sets = {'王成亮','闫瑞龙','曹俊良','吴峻杰','傅元超','孙嘉驰','肖振宇'}

for i in sets:
    print(i)
'''
'''

#字典的遍历

dict1 = {'WCF':'王超凡','WS':'王硕','WCL':'王成亮','WYC':'王媛春'}

#字典值访问：  字典变量[键]  


#遍历字典的键
for i in dict1:
    #输出键
    print(i)
    #输出值
    # print(dict1[i])
'''


'''
#二级列表/元组的遍历
'''
lists = [
            ['高坡','曹睿'],
            ['杨小亮','吴相检'],
            ['孙成林','付彬'],
            ['郑小飞','乔宽宽']
        ]
'''

lists = {
            ('高坡','曹睿'),
            ('杨小亮','吴相检'),
            ('孙成林','付彬'),
            ('郑小飞','乔宽宽')
        }

for i,j in lists:
    print(i)
    print(j)

'''

'''
#该遍历的常用数据

    [(),(),()] 列表中有元组
    [[],[],[]] 列表中有列表
    ((),(),()) 元组中有元组
    {(),(),()} 集合中有元组
    字典的特殊使用
'''


#遍历字典的特殊方式
dict1 = {'WCF':'王超凡','WS':'王硕','WCL':'王成亮','WYC':'王媛春'}

a={j,i for i,j in dict1.items}
print(a)
    # print(j)



'''
lists = ['王晶晶','张晶晶','张巧玲','赵旭','齐婷婷']

for i in lists:
    print(i)
else:
    print('循环结束了！')
'''