#10*10 星星矩阵


#生成10行星星
j = 0
while j<10:
    #输出1行星星
    #1行10列的星星
    i = 0
    while i<10:
        #输出一个星星
        print('★',end='')
        #变量+1
        i += 1
    #输出一个换行
    print('\n',end = '')
    #变量+1
    j += 1


#------------------------
print('-------------------------')
#10*10的隔行变色的星星






#10行星星
j = 0
while j<10:
    #输出1行星星
    #1行10列的星星
    i = 0

    while i<10:
        #输出1个星星
        #判断当前行数是奇数行还是偶数行
        if j % 2 ==1:#奇数行
            print('★',end = '')
        else:#偶数行
            print('☆',end = '')
        #变量+1
        i += 1
    #输出1行星星之后添加回车
    print('\n',end = '')
    #变量+1
    j += 1
