#1个循环10行10列

star = 0

while star <100:
    #输出星星
    print('★',end = '')
    #判断，是否到了一行结束的位置，加一个回车即可
    if star % 10 == 9:
        print('\n',end = '')
    #变量+1
    star += 1


print('--------------------------')

#1个循环10行10列 隔行变色

i = 0
while i<100:
    #输出星星
    #判断是奇数行还是偶数行
    if i // 10 % 2 == 1:#j奇数行
        print('★',end = '')
    else:
        print('☆',end = '')
    
    
    #在每一行的末尾添加回车
    if i % 10 ==9:
        print('\n',end = '')
        
    #变量+1
    i += 1


print('--------------------------')

#1个循环10行10列 隔列变色

i = 0

while i<100:
    #输出星星
    #判断当前星星是奇数个还是偶数个
    if i % 2 == 0:
        print('★',end = '')
    else:
        print('☆',end = '')
        
    #在指定的行末尾添加换行
    if i % 10 ==9:
        print('\n',end = '')
    #变量+1
    i += 1
